{"meta":{"title":"ZERO","subtitle":"","description":"算是半个有趣的人","author":"ZERO JAN","url":"http://www.zero-jan.xyz","root":"/"},"pages":[{"title":"about","date":"2021-01-18T13:50:10.000Z","updated":"2021-01-18T14:21:53.288Z","comments":false,"path":"about/index.html","permalink":"http://www.zero-jan.xyz/about/index.html","excerpt":"","text":"ZEROのBlog 模块开发中，敬请期待 bot_ui_ini()"},{"title":"analytics","date":"2021-01-18T13:46:49.000Z","updated":"2021-01-18T13:46:49.088Z","comments":true,"path":"analytics/index.html","permalink":"http://www.zero-jan.xyz/analytics/index.html","excerpt":"","text":""},{"title":"archives","date":"2021-01-18T13:46:31.000Z","updated":"2021-01-18T13:46:31.254Z","comments":true,"path":"archives/index.html","permalink":"http://www.zero-jan.xyz/archives/index.html","excerpt":"","text":""},{"title":"bangumi","date":"2021-01-18T13:48:32.000Z","updated":"2021-02-06T06:21:50.702Z","comments":false,"path":"bangumi/index.html","permalink":"http://www.zero-jan.xyz/bangumi/index.html","excerpt":"","text":""},{"title":"books","date":"2021-01-18T13:48:15.000Z","updated":"2021-01-18T13:48:16.011Z","comments":true,"path":"books/index.html","permalink":"http://www.zero-jan.xyz/books/index.html","excerpt":"","text":""},{"title":"分类","date":"2021-01-18T13:47:36.000Z","updated":"2021-01-18T13:57:06.261Z","comments":false,"path":"categories/index.html","permalink":"http://www.zero-jan.xyz/categories/index.html","excerpt":"","text":""},{"title":"comment","date":"2021-01-18T13:48:46.000Z","updated":"2021-01-19T08:58:15.098Z","comments":true,"path":"comment/index.html","permalink":"http://www.zero-jan.xyz/comment/index.html","excerpt":"","text":"念两句诗 正在加载今日诗词.... jinrishici.load(function(result) { var poem = result.data.content; var info = \"【\"+result.data.origin.dynasty+\"】\"+ result.data.origin.author +\"《\" + result.data.origin.title + \"》\"; document.getElementById(\"poem\").value(poem); document.getElementById(\"info\").value(info); })"},{"title":"donate","date":"2021-01-18T13:49:14.000Z","updated":"2021-01-18T14:52:28.552Z","comments":false,"path":"donate/index.html","permalink":"http://www.zero-jan.xyz/donate/index.html","excerpt":"","text":""},{"title":"links","date":"2021-01-18T13:49:01.000Z","updated":"2021-02-02T15:28:39.022Z","comments":true,"path":"links/index.html","permalink":"http://www.zero-jan.xyz/links/index.html","excerpt":"","text":""},{"title":"music","date":"2021-02-06T05:38:21.000Z","updated":"2021-02-06T05:51:03.115Z","comments":false,"path":"music/index.html","permalink":"http://www.zero-jan.xyz/music/index.html","excerpt":"","text":""},{"title":"photos","date":"2021-01-18T13:48:03.000Z","updated":"2021-01-18T13:48:03.848Z","comments":true,"path":"photos/index.html","permalink":"http://www.zero-jan.xyz/photos/index.html","excerpt":"","text":""},{"title":"tags","date":"2021-01-18T13:47:21.000Z","updated":"2021-01-18T13:56:57.903Z","comments":false,"path":"tags/index.html","permalink":"http://www.zero-jan.xyz/tags/index.html","excerpt":"","text":""},{"title":"theme-sakuraplus","date":"2021-01-18T13:49:54.000Z","updated":"2021-01-18T13:49:54.176Z","comments":true,"path":"theme-sakuraplus/index.html","permalink":"http://www.zero-jan.xyz/theme-sakuraplus/index.html","excerpt":"","text":""}],"posts":[{"title":"计算机三级嵌入式系统开发技术（持续更新中……）","slug":"计算机三级嵌入式系统开发技术","date":"2021-01-30T14:36:34.000Z","updated":"2021-02-06T07:33:13.128Z","comments":true,"path":"posts/e738.html","link":"","permalink":"http://www.zero-jan.xyz/posts/e738.html","excerpt":"","text":"第一章-嵌入式系统概论考点1 嵌入式系统及其应用什么是嵌入式系统？ 嵌入式系统是嵌入式计算机系统的简称。顾名思义，它是一种嵌入在设备（或系统）内部，为特定应用而设计的专用计算机系统 嵌入式系统的共同特点 专用性与具体应用紧密结合，具有很强的专用性 隐蔽性通常隐藏在内部，不为人知；例如：ATM柜员机、数码相机 资源受限软硬件资源受到严格限制 高可靠性对于汽车等中的嵌入式，任何误动作都是致命的 实时性温控需要实时数据 软件固化ROM固化 嵌入式系统的应用 消费类应用产品 “白色家电”冰箱、洗衣机、空调、微波炉、电饭煲、热水器等 数码产品电视机、家庭影院、PDA、电子字典、游戏机、智能玩具等 产业类应用产品 工业设备数控机床、工业机器人、机电一体化设备、生产线控制等 运输工具汽车、飞机、铁路机车、船舶、电梯等 医疗电子设备X光机、B超（超声诊断仪）、CT（计算机断层成像系统）、心脏起搏器、监护仪 业务类应用产品 办公设备电话机、传真机、打印机、复印机等 金融电子设备电子秤、POS（商用零售终端）、ATM（自动柜员机）、信息亭等 通信设备手机、GPS导航仪、Moderm、路由器、Hub（集线器）、交换机、网桥等 军用类应用产品 武器控制装置火炮、导弹、智能炸弹的制导引爆等 军用电子装备坦克、舰艇、战机、无人机等 军事通信装备雷达、电子对抗、导航系统等 嵌入式系统的发展意义 嵌入式系统在应用数量上远远超过了各种类型的通用计算机系统。 嵌入式系统正在逐步渗透到人类社会的各个领域，嵌入式应用构成了所谓“ 无所不在的计算时代 ”。 嵌入式系统的研发能力及产业化水平已经成为衡量一个国家经济发展、科技进步和国防实力的重要标志 。 考点2 嵌入式系统的组成嵌入式系统的逻辑组成 嵌入式系统与通用计算机一样，也是由硬件和软件两部分组成的。 硬件的主体是中央处理器和存储器，它们通过输入/输出(I/O)接口和输入/输出设备与外部世界联系 ，并借助总线相互连接，这些硬件连同嵌入式软件一起构成完整的嵌入式系统。 处理器的组成 能按照指令的规定高速度完成二进制数据算术和逻辑运算的部件称为“处理器” 它由运算器、控制器、寄存器、高速缓冲存储器（Cache）等部件组成，结构相当复杂。 处理器的所有组成部分都可以制作在一块大小仅为几cm2的半导体芯片上。 嵌入式系统中的处理器分类 中央处理器（CPU）负责运行系统软件和应用软件的主处理器 协处理器DSP（数字信号处理器）、图形处理器、通信处理器 中央处理器（CPU）的参数 字长指的是CPU中通用寄存器和定点运算器的二进位宽度 CPU字长4位、8位、16位、32位和64位（通用计算机64位为主） 说明：虽然32位和64位是当前技术发展的主流，但销量仅占全部微处理器的10%左右 CPU性能表现为程序（指令）执行速度的快慢 中央处理器（CPU）特点 支持实时处理 低功耗 结构可扩展 集成测试电路 影响程序（指令）执行速度的因素 主频、指令系统、Cache的容量与结构和逻辑结构。 存储器的分类 易失性存储器即掉电后信息丢失SARM（静态随机存取存储器）、DRAM（动态随机存取存储器） 非易失性存储器E2PROM（电可擦可编程只读存储器）、Falsh ROM、磁盘和光盘存储器 说明：非易失性存储器有多种类型。以前使用较多的是Mask ROM和E2PROM，目前使用较多是闪存，即Falsh Memory。 Mask ROM是基于掩膜工艺技术的只读存储器，一旦生产出来信息不可改变，主要用于不可升级的成熟产品存储程序或不变的参数等信息； Falsh Memory是一种长寿命的非易失性存储器，是近些年应用最广的只读存储器。 I/O设备按其服务对象分类 用于人机交互的设备键盘、鼠标、话筒、LED、LCD、打印机等，他们是用户界面的硬件部分。 用于机机交互的设备包括各种类型的传感器（压力传感器、电流电压传感器等）和各种伺服执行机构（继电器、微电机、步进电机等） I/O接口的分类 按数据传输速率低速和高速 按数据传输方式串行和并行 按是否需要物理连接有线和无线 按是否能连接多个设备总线式和独占式 嵌入式系统常用的I/O接口 通用串行总线式接口USB2.0/USB3.0、IEEE 1394、以太网接口 异步串行接口RS-232-C、RS-485 视频信号接口VGA接口（视频图形排列接口）、DVI接口（数字视频接口）、HDMI接口（高清晰度多媒体接口） 工业总线接口CAN接口（控制器局域网接口）、1553B接口、LIN接口（局域互联网接口） 无线接口IrDR接口（红外线接口）、Bluetooth接口（蓝牙接口）、ZigBee接口、WiFi接口 数据总线的概念 数据总线简称总线，它是嵌入式系统各组件之间进行数据传输的一个传输通路。它由传输线和控制电路组成，为连接在总线上的系统内或系统外的各个组件提供数据传输和相应的控制服务。 嵌入式系统的软件配置 低端嵌入式系统软件很简单，它们不需要操作系统，只需配置一个监控程序、若干设备驱动程序和事件处理程序即可。 高端嵌入式系统软件配置比较复杂。它通常由板级支持包（BSP）、设备驱动程序、实时操作系统、中间件以及嵌入式应用软件等组成。 嵌入式处理芯片4种产品类型 微处理器根据CPU的字长，微处理器产品分为4位、8位、16位、32位和64位 ，产品主要有PowerPC、MC68000、MIPS、AMD、x86。 数字信号处理器DSP是一种专用于数字信号处理的微处理器，它对通用处理器的逻辑结构和指令系统进行了优化设计，使之能更好地满足高速数字信号处理的要求。 微控制器（单片机）微控制器实际上是一种将若干个功能模块集成在单个芯片中的小型计算机。它们的工作频率不高，存储容量较小，功耗很低；MCU按其使用的处理器内核的位数，也经历了1位、4位、8位、16位以及32位的发展阶段。早先的4位主要用于家用电器的控制单元，8位和16位用于一般的控制领域，近年来32位MCU迅速发展。MCU品种多，应用广泛，约占有嵌入式系统70%的市场。 片上系统（SoC）半导体加工工艺已经进入到深亚微米时代，能够把计算机或其他一些电子系统的全部电路都集成在单个芯片上，这种芯片就是所谓的片上系统。因此片上系统是集成电路加工工艺进入到深亚微米时代的产物 。目前，大多数高端嵌入式系统均采用 SoC（片上系统），例如：智能手机。 说明：将嵌入式系统的几乎全部功能都集成在一块芯片中，单个芯片就能实现数据的采集、转换、存储、处理和输入/输出等多种功能。 考点3 嵌入式系统的分类嵌入式系统的分类 按用途分类军用、工业用和民用 按实时性的分类非实时系统、软实时系统和硬实时系统 按产品形态分类系统级产品、板级产品和片级产品 按软硬件复杂程度分类低端系统、中端系统和高端系统 不同类型嵌入式系统的比较 类型 硬件特征 软件特征 应用举例 低端系统 采用4位/8位单片机 不使用操作系统，由监控程序对系统进行控制 在工控领域和白色家电领域占主导地位 中端系统 采用8位/16位单片机或32位处理器 使用小型嵌入式操作系统，应用程序规模较小，用户界面比较简单 普通手机、摄像机、录像机、电视游戏机等（2G） 高端系统 采用32位/64位处理器，支持连接网络 操作系统功能比较齐全，使用图形用户界面，应用软件可更新和扩展 智能手机、掌上计算机、路由器、气象数据处理设备等 考点4 SoC芯片1、微电子技术集成电路以及制造 微电子技术是以半导体集成电路为核心。根据所含电子元件的数目可以分为小规模、中规模、大规模和极大规模等几种。 大规模集成电路（LSI）集成度在3000~10万个电子元件之间的集成电路。 超大规模集成电路（VLSI）集成度在10万~100万个电子元件之间的集成电路。 极大规模集成电路（ULSI）集成度超过100万个电子元件的集成电路。 集成电路的制造工艺复杂且技术难度非常高，其中有一系列的关键技术。许多工序必须在恒温、恒湿、超洁净的无尘厂房内完成，生产、控制及测试设备异常昂贵。 集成电路是在硅衬底上制作而成的。 制造集成电路所用的工艺技术称为硅平面工艺，包括氧化、光刻、掺杂等多项工艺。 集成电路的发展趋势 集成电路的特点是体积小、重量轻、可靠性高； 集成电路的工作速度主要取决于组成逻辑门电路的晶体管的尺寸。晶体管的尺寸越小，其极限工作频率越高， 门电路的开关速度就越快。 芯片上电路元件的线条越细，相同面积的晶片可容纳的晶体管就越多，功能就越强，速度也越快。 当前，世界上最为先进的制作工艺已经达到12~14英寸晶圆、45nm或32nm的工艺水平，并还在进一步提高。 最复杂的CPU芯片所集成的晶体管数目已超过10亿个，移动设备存储卡所用的每个芯片包含的晶体管数量已达100亿个。 目前，芯片中晶体管数目已达数十亿个，时钟频率达到10GHz （不是工作频率） 微机电系统 MEMS体现了近年来机电一体化技术向微型化的发展； 目前的MEMS产品有压力传感器、加速仪、陀螺仪、麦克风、微射流器件等许多种，它对促进产品小型化、智能化、集成化有重大的作用； 在智能手机中应用广泛。 2、通用SoC和专用SoC通用SoC 指半导体企业通过自主开发处理器内核或购买其他企业的处理器内核的IP授权，按照目标应用领域功能要求所开发的SoC芯片系列； 如：三星Exynos系列、英达伟Tegra系列、高通骁龙系列、联发科MT系列，这些芯片大多采用ARM公司的Cortex-A架构作为CPU内核。 说明： 通用的芯片中可以只有一个CPU（或DSP ），称为单核SoC，也可以包含多个CPU（或DSP ），称为多核SoC。 专用SoC 嵌入式系统开发商依据待开发产品的特殊要求，向半导体企业定制的SoC芯片； 如：苹果公司的iPhone、iPad和iPod等消费电子产品。 3、SoC芯片的开发流程 总体设计按照系统需求说明书确定SoC的性能参数，并据此进行系统全局的设计。 逻辑设计将总体设计的结果用RTL语言进行描述（源文件）后，再使用逻辑综合软件将源文件进行综合，生成最简的布尔表达式和信号的连接关系。 综合仿真这一阶段将对由RTL生成的各部分电路图作芯片电路综合及仿真测试。 芯片制造将经过验证后的逻辑电路配置入SoC芯片内，并与其他电路进行互连。 4、IP核及其复用IP核 以库中所包含的IC设计文件按其功能复杂程度分为三类： 逻辑门级，包括各种基本的门电路； 寄存器传输级，如寄存器、多路选择器、译码器、数据转换器等； 行为级（又称为功能级），如CPU、DSP、存储器、总线与接口电路等。 这些已完成的并经过验证的IC具有固定的不可再分解的功能特性，人们称之为“核”（Core），相应的数据库称为“核库”。 核库中的设计文件均属于知识产权（IP）保护的范畴。 IP核分类： 软核、固核和硬核。（类比：砖、房间、一层楼） 从可重用的频度、重用的灵活性以及可向其他工艺移植的可能性的角度考虑，这三种IP核的优选次序是软核、固核和硬核； 从保证满足所要求的性能和规范、上市时间短、开发工作量少且不在乎成本的角度考虑，这三种IP核的优选次序是 硬核、固核和软核。 IP核复用 SoC芯片的产生是半导体集成电路技术发展到一定阶段的产物，是集成电路芯片的跨越式发展； IP核是开发SoC的重要保证，IP核复用可以减少研发成本，缩短研发时间； 以CPU为例。所有SoC芯片都包含CPU，它们绝大多数都是以IP核的方式集成在SoC芯片中的，很少再自行设计开发； 目前主要的CPU内核有：ARM、MIPS、PowerPC、Coldfire、x86、8051等； ARM内核的授权内容包括：芯片内核设计技术、完整的软件开发工具（编译器、调试器、 软件开发套件SDK）、 含ARM CPU的芯片销售权等。 考点5 数字（电子）文本1、字符集及其编码 文本是基于特定字符集的一个字符流，每个字符均使用二进制编码表示。 西文字符的编码 目前计算机中使用得最广泛的西文字符集及其编码是ASCII字符集和ASCII码，即美国标准信息交换码。 基本的ASCII字符集共有128个字符，包括96个可打印字符（常用的拉丁字母、阿拉伯数字、标点符号等）和32个控制字符，每个字符使用7个二进制位进行编码。 汉字的编码 我国目前广泛使用的汉字编码国家标准有GB2312和GB18030； GB2312只有6763个汉字，而且为简体字，在人名、地名的处理上经常不够使用。尤其是在古籍整理和研究方面有很大缺憾。 GB2312国标字符集中包含3775个一级常用汉字和3008个二级常用汉字，此外还有682个图形符号（包括拉丁字母、俄文、日文平假名与片假名、希腊字母、汉语拼音等）。 我国在2005年又发布了GB18030中文编码国家标准。 UCS/Unicode编码 用于计算机统一处理、存储和传输包含世界各国和地区所有各种语言文字的需求；编码方案最常用的有两种：UTF-8和UTF-16。 UTF-8采用的是单字节可变长编码，一般使用3字节编码，极少数使用4字节。 UTF-16采用的是双字节可变长编码，一般使用双字节编码，其他不常用字符使用4字节。 说明：GB18030字符集与国际标准UCS/Unicode字符集基本兼容，但其码制不一样；GB18030与UCS/Unicode均包含中日韩统一汉字（CJK）约7万多个。 2、文本的类型根据是否具有排版格式分类 简单文本几乎不包含任何其他的格式信息和结构信息，也称为纯文本，文件扩展名是.txt； 丰富格式文本需要对纯文本进行必要的加工，也称为富文本，文件扩展名包括：.doc、.html和.pdf。 根据文本内容的组织方式分类 线性文本文本中的内容组织是线性（顺序）的，如简单文本。 超文本采用网状结构来组织信息，文本中的各个部分按照其内容的逻辑关系相互链接，如WWW网页是最为常见的超文本。。 3、文本的制作与展现文本制作 文字处理软件：WPS、Microsoft Word等等。数字文本阅读器可以是软件，也可以是一种称为“电子书阅读器”的嵌入式应用产品。 2009年PDF格式被批准为我国用于长期保存的电子文档格式的国家标准。 PDF（便携式文件格式）是由Adobe Systems在1993年用于文件交换所发展出的文件格式。它的优点在于跨平台、能保留文件原有格式（Layout）、开放标准，能免版税（Royalty-free）自由开发PDF相容软体，是一个开放标准，2007年12月成为ISO 32000国际标准。 文本展现（阅读） 数字电子文本主要有两种展现方式：打印输出和在屏幕上进行阅读。 字符的形状有两种描述方法：点阵法和轮廓法。 考点6 数字图像 嵌入式系统中使用的数字图像也称为取样图像、点阵图像或位图图像。 1、数字图像的获取与主要参数数字图像的获取所使用的设备及其功能 设备：数码相机和扫描仪。 功能：将实际景物的2D映像输入到计算机内并以数字图像的形式进行表示。 数字图像的获取处理步骤​ 图像的获取过程的核心是模拟信号的数字化，处理步骤大体分为4步： 扫描扫描将画面划分为M x N个网格，每个网格称为一个取样点。离散化 分色将每个取样点的颜色分解成红、绿、蓝（R、G、B）3个基色，如果是灰度图像或黑白图像，则不必进行分色。 取样测量每个取样点的每个分量（基色）的亮度值。 量化对取样点每个分量的亮度值进行A/D转换，即把模拟量使用数字量（一般是8位至12位的正整数）来表示。 数字图像的主要参数及其含义 图像大小也称为图像分辨率（用水平分辨率 x 垂直分辨率表示）。日常所说的高清图像分辨率为1920 x 1080； 位平面数目即像素颜色分量的数目。黑白或灰度图像只有一个位平面，彩色图像有3个或更多的位平面； 像素深度指每像素用多少个二进制位来表示。它是像素的所有颜色分量的二进制位数之和，它决定了图像中可能出现的不同颜色（或不同亮度）的最大数目。例如单色图像，若其像素深度是8位，则不同亮度等级的总数为28=25； 颜色模型指彩色图像所使用的颜色描述方法。通常， 显示器使用的是RGB( 红、绿、 蓝）模型， 彩色打印机使用的是CMYK(青、品红、黄、黑）模型。 2、数字图像常用文件格式及其应用一副图像的数据量计算公式(以字节为单位) 图像数据量 = 图像水平分辨率 x 图像垂直分辨率 x 像素深度 / 8 数据压缩的类型 无损压缩指使用压缩以后的数据还原图像（也称为解压缩）时，重建的图像与原始图像完全相同，没有一点误差。例如：行程长度编码（RLE）、哈夫曼编码。压缩率不高 有损压缩指使用压缩后的图像数据进行还原时，重建的图像与原始图像虽有一些误差，但不影响人们对图像含义的正确理解和使用。为了得到较高的数据压缩比，数字图像的压缩一般都采用有损压缩，如变换编码、矢量编码等。 嵌入式系统常用的几种图像文件的格式 名称 压缩编码办法 性质 典型应用 开发公司（组织） BMP RLE 无损 Windows应用程序 Microsoft TIF RLE，LZW 无损 桌面出版 Aldus，Microsoft GIF LZW 无损 互联网 CompuServe JPEG DCT，哈夫曼编码 大多为有损 互联网、数码相机等 ISO/IEC PNG LZ77派生的DEFLATE压缩算法 无损 互联网、桌面出版等 W3C PNG属于静态图像格式 考点7 数字音频与数字视频 音频指的是人耳可听见的声音信号，视频泛指活动图像序列，它们都是传递信息的重要媒体。共同的特点是内容随时间而变化，所以也称为动态媒体。 1、音频/视频信息的数字化 音频是频率范围为20Hz~20kHz的模拟信号。为了使用计算机进行处理，必须将它转换成二进制编码表示的形式， 这个过程称为声音信号的数字化。 声音信号数字化的过程 取样把时间上连续的声音信号离散为不连续的一系列的样本； 量化把每个样本的模拟量转换成数字量来表示，因此量化过程往往也称为A/D转换； 编码经过取样和量化得到的数据必须进行数据压缩，以减少数据量，并按某种格式将数据组织为文件，以便于计算机进行存储、处理和传输。 视频信号数字化的过程 视频信号数字化的过程比声音复杂一些，它以一幅幅画面（称为帧 ）为单位进行。 2、数字音频常用文件格式及其应用数字音频的主要参数 数字音频的主要参数包括取样频率、量化位数、声道数目、使用的压缩编码方法以及比特率； 比特率也称为码率，它指的是每秒钟的数据量。 数字音频未压缩前，码率的计算公式波形声音的码率=取样频率 x 量化位数 x 声道数（单位：b/s）注意： 压缩编码后的码率则为压缩前的码率除以压缩倍数（压缩比）。 常用的数字音频的文件格式、编码格式以及它们的主要应用 数字视频压缩编码的国际标准及其应用 数字视频及其伴音的文件格式 国际标准MPEG格式（ .dat、.mpg、.mpeg、.mp4、.vob、.3gP、.3g2等）。 微软公司的AVI（.avc）和ASF（.asf）格式（后者适合流媒体应用）。 苹果公司的QTFF格式（.mov和.qt）。 DivX公司的DivX（.divx）格式。 Real Network公司的RM（.rm）和RMVB（.rmvb）格式（ .rmvb格式是.rm的扩充，它采用H.264/MPEG-4 AVC算法， 增加了可变码率编码的功能，性能优于DivX和Xvid目前互联网上许多视频都是RMVB格式）。 Adobe公司的FLV（.flv）和F4V（.f4v）格式以及开放源代码的Matroska格式（.mkv）等。 说明：.asf、.wmv、.mov、.rm、.rmvb、.flv和.f4v等均支持流式传输 ，能很好地在互联网上进行音频/视频流的实时传输和实时播放，满足互联网上视频直播、视频点播、视频会议等应用的需求，得到了广泛的应用。 考点8 数字通信1、模拟通信与数字通信通信的基本任务与三要素 通信的基本任务是传递信息，至少需由3个要素组成：信息的发送者（称为信源）、信息的接收者（称为信宿）和携带了信息的电（或光）信号以及信息的传输通道（称为信道）。 通信系统中所传输的信息形式 通信系统中所传输的信息必须以电（或光）信号的形式才能通过传输介质进行传输。电（或光）信号有两种形式：模拟信号和数字信号 模拟信号：通过连续变化的物理量（如电平的长度或电流的强度）来表示信息，例如人们打电话或者播音员播音时，声音经话筒（麦克风）转换得到的电信号就是模拟信号； 数字信号：它的电平高低或电流大小只有有限个状态（一般是两个状态），它们在时间上有时也是不连续的。例如 电报机、传真机和计算机发出的信号都是数字信号 说明：由于模拟信号在传输过程中容易受噪声信号的干扰，所以传输质量不稳定。目前最常用的通信方式是数字通信技术，既把模拟信号转换成数字信号后再进行传输（或信源本身发出的就是数字信号）。数字通信的实例：手机通信、数字有线电视（或卫星电视）和固定电话中继通信（及长途通信）等。 2、有线与无线通信通信传输介质类型、特点和应用 有线通信中使用的传输介质是金属导体或光导纤维，金属导体利用电流传输信息，光导纤维通过光波来传输信息。 无线通信根本不需要物理连接，而是通过电磁波在自由空间的传播来传输信息。 有线通信 通信中使用金属电缆（双绞线和同轴电缆）的历史已经很长，技术相当成熟； 目前光纤已经远超金属电缆的性能，光纤是光导纤维的简称，它由纤芯和包层组成，包层外有涂覆层，为光纤提 供物理保护，屏蔽外部光源的干扰； 光纤传输的优点：通信容量大、传输距离远、抗辐射能力强、保密性强以及重量轻便于运输和建设； 无线通信 优点：允许终端设备在一定范围内自由移动；灵活性好。 缺点：传输效率低、易被窃听和易受干扰；安全性差。 按频率分类：中波、短波、超短波和微波等波段； 适用范围：中波主要沿地面传播，绕射能力强，适用于广播和海上通信。短波具有较强的电离层反射能力，适用于环球通信。超短波和微波的绕射能力较差，只能作为视距或超视距中继通信；微波是数字通信的主流。 微波的应用实例 微波是一种300MHz~300GHz的电磁波，它具有类似光波的特性，在空间主要作直线传播（视距传播）。利用微波进行远距离通信时，需要依靠地面微波站进行接力通信，微波站的中继距离一般为50Km左右。微波通信的另一种途径是借助人造卫星进行接力通信，此时中继站就安装在通信卫星上，这种通信方式也称为卫星通信。 手机是微波最有代表性的一种应用。 第1代个人移动通信采用的是模拟传输技术； 第2代，使用的频段扩至900MHz到1800MHz多年来我国广泛使用的GSM和CDMA都是第2代移动通信系统，俗称全球通移动通信系统，简称2G； 第3代个人移动通信，3G的频谱利用率比2G高，使用的频段也成倍增长（1885~2025MHz，2110~2200MHz）因此数据传输能力比2G大幅度提高； 第4代移动通信，4G传输速率可达100Mb/s 。中国移动采用TD-LTE制式，其4G手机将兼容3G（TD-SCDMA）和2G（GSM）模式；中国电信和联通采用FDD-LTE制式，其终端设备（手机、上网卡等）也采用多模工作方式，即分别与原先使用的3G和2G模式保持兼容； 5G，发展中。 3、数字通信的传输技术调制与解调技术 信息传输时，利用信源信号去调整（改变）载波的某个参数（幅度、频率或相位），这个过程称为调制； 经过调制后的载波携带着被传输的信号在信道中进行长距离传输；到达目的地时，接收方再把载波所携带的信号检 测出来恢复为原始信号的形式，这个过程称为解调。 多路复用技术为了提高传输线路的利用率，降低通信成本，一般总是让多路信号同时共用一条传输线进行传输；分为如下两种： 时分多路复用（TDM），技术中各通信终端（如电话机）以事先规定的顺序轮流使 用同一传输线路进行信号（或数据）传输。 频分多路复用（FDM），它将每个 信源发送的信号调制在不同频率的载波上， 通过多路复用器将它们复合成为一个信号，然后在 同一传输线路上进行传输。 波分多路复用（WDM），它是频分多路复用技术的一种。 交换技术 电路交换的特点是：在通话的全部时间内用户始终占用端到端的传输信道。 电话交换机采用的是电路交换技术。即通话前经过拨号接通双方的线路（建立一条物理通路），通话后再释放（拆线）。 分组交换的特点是：电路交换的使用效率太低，解决的方法是采用分组交换（也称包交换）。它的优点是大大提高传输线路的利用率；同时也存在缺点，产生额外开销。 路由器 考点9 计算机网络1、计算机网络的组成与类型计算机网络的概念 计算机网络是利用通信设备、传输线路和网络软件，把地理上分散的许多计算机及其他智能设备以相互通信和共享资源为目的连接起来的一个系统。它是一种数据通信系统。 计算机网络的组成 计算机等智能电子设备 它是网络的通信终端，如手机、电视机顶盒、监控报警设备、厨房卫生设备等； 数据通信链路 用于数据传输的双绞线、同轴电缆、光缆，以及为了有效而可靠地传输数据所必需的各种通信控制设备（如网卡、集线器、交换机、调制解调器、路由器等），它们构成了计算机与通信设备、计算机与计算机之间的数据通信链路；有限设备与无线设备 通信协议 为确保网络的互联互通，计算机和通信控制设备必须共同遵循一组规则和约定，这些规则、约定或标准就称为通信协议，简称协议； 网络软件 通信软件的功能就是实现网络通信协议，它们一般都包含在操作系统中。还包括网络应用，如电子邮件程序、浏览器程序、即时通信软件、网络游戏软件等。 计算机网络的类型 按使用的传输介质可分为有线网和无线网； 按网络的使用性质可分为公用网和专用网； 按网络的使用范围和使用对象可以分为企业网、政府网、金融网和校园网； 更多的情况下，人们按网络所覆盖的地域范围把计算机网络分为： 广域网（WAN） 也称为远程网，网络的作用范围可以从几十到几千km甚至更大。广域网往往覆盖一个国家、地区，或横跨几个洲，形成国际性的计算机网络。 城域网（MAN） 也称为市域网，其作用范围为5~50km。 局域网（LAN） 网络的地域范围较小（如几km）通常是一幢楼房、一个楼群或一个小区局域网往往属于一个单位所有，由单位自建自管； 个域网（PAN） 一般指个人域网。是指能在便携式消费电器与通信设备之间进行短距离通信的网络，其覆盖范围一般在10m半径以内。 2、以太局域网以太局域网的概念 以太局域网常见于公司、学校、机构和家庭，是计算机网络中最流行的一种形式，全世界估计有几百万个计算机局域网；现在流行的是使用交换机组成的交换式以太网。 计算机局域网的主要特点 为一个单位所拥有，自建自管，地理范围有限。 使用专门铺设的传输介质进行联网和数据通信。主要是双绞线 数据传输速率高（10Mb/s~10Gb/s），延迟时间短，误码率低（10-8~10-11）。 局域网使用的数据交换技术与数据格式 发送设备MAC地址 接收设备MAC地址 控制信息 有效载荷（传输的数据） 校验信息 局域网的划分 按照它所使用的传输介质 有线网和无线网； 按照网络中终端设备互联的拓扑结构 星型网、环型网、总线型网、混合型网等； 按照传输介质所使用的访问控制方法 以太网、FDDI网和令牌网等。 不同类型的局域网采用不同的通信协议。目前广泛使用的是以太网，它以集线器或交换机为中心构成。 3、无线局域网无线局域网的概念 无线局域网（WLAN）是以太网与无线通信技术相结合的产物。它借助无线电波进行数据传输，工作原理与有线以太网基本相同。 无线局域网最大的优点：能方便地移动计算机的位置或改变网络的组成。 无线局域网借助无线电波进行传输 ，使用的无线电波， 主要是2.4GHz和5.8GHz两个频段。注意单位 无线局域网采用的协议主要是IEEE 802.1（俗称WiFi）。包括802.1a、802.1b、802.1g和802.1n等，其中IEEE 802.1n协议已经将传输速率进一步提高到108Mb/s甚至更高 无线局域网的构建 无线局域网需使用无线网卡、无线接入点等设备构建。无线接入点也被称为“热点”它就是一个无线交换机或无线 , 相当于手机通信中的基站 。 构建无线局域网的另一种技术是蓝牙。它是一种短距离、低速率、低成本的无线通信技术，其目的是去掉手机、平板电脑等移动终端设备之间以及它们与一些附属装置（如耳机、鼠标等）之间的连接电缆，构成一个操作空间在几m范围内的无线个人区域网络。 考点10 互联网1、IP协议与路由器 要想极大地发挥网络的作用又必须把许多同构或异构的网络互相连接起来，这就必须解决诸如计算机统一编址、数据包格式转换等一系列问题。解决这些问题的途径是使用TCP/IP协议中的IP协议（网络互连协议）和路由器（router） IP地址 TCP/IP协议中的IP协议定义了主机的概念，是指任何按照TCP/IP协议连接到网络的终端设备。如PC机、手机、平板电脑，也可以是服务器或网络打印机等其他设备；所有主机使用一种统一格式的地址（简称IP地址 ）进行标识。 IP协议第4版（简称IPv4） 规定，每个IP地址使用4B(32个二进制位 ）表示，其中包含有网络号和主机号两部分。 前者用来指明主机所从属的物理网络的编号（称为网络号），后者是主机在所属物理网络中的编号（称为主机号）。 一个IP地址可有4个十进制数来表示，每个十进制数对应IP地址中的一个字节，十进制数之间采用小数点予以分隔， 这种方式被称为“点分十进制”； 一个 /6 地址可分为A类、B类、C类3个基本类。C类网络地址数量较多，适用于小规模的局域网络，每个网络最多只能包含254台计算机。另有两类分别作为组播地址和备用地址（D类和E类）。 IP中地址长度仅为32位，只有大约36亿个地址可用。 2011年年初国际组织ICANN宣布地址已全部分配完毕。 新的IPv6协议已经把IP地址的长度扩展到128位，几乎可以不受限制地提供IP地址。 IP数据报 互联的各个物理网络，它们使用的数据包（或帧）的格式可能互不兼容，因此不能将一个网络送来的包直接传送给另一个网络。为了克服这种异构性，IP协议定义了一种独立于各种物理网的数据包的格式，称为IP数据报。 IP数据报的组成 IP数据报由两部分组成：头部和数据区 头部信息： 为了确定在网络中进行数据传输的路由，内容包括： 发送数据报的终端设备的IP地址； 接收数据报的终端设备的IP地址； IP协议的版本号（目前大量使用的还是IPv4） 头部长度（以32位为单位指出数据报头部的长度〉； 数据报长度（整个数据报的长度，即头部长度加上数据区的长度）； 服务类型（指明发送方设备对数据传输的要求，例如，希望以低延迟方式传输，或者以高速率方式传输等）。 数据区： 数据区的长度可以根据应用而改变，数据量最小的时候也许只有1B（例如传送键盘上输入的一个字母），最大的时候可以达到64KB（包括头部信息在内）。 说明：所有需要在TCP/IP网络中传输的数据在IP这一层面都必须封装或分拆成IP数据报之后才能进行发送或接收。 路由器 路由器是遵循IP协议把异构网络互相连接起来的关键设备，它屏蔽了不同网络的技术差异，能将发送设备的数据正确送达接收设备，确保了各种不同物理网络的无缝连接。 路由器是一台高性能的嵌入式计算机系统，也是一种分组（IP数据报）交换机，其功能主要是选择路由和转发IP数据报，并进行协议转换。 路由器有多个输入端口和多个输出端口， 路由器之间一般都使用高速通信链路连接，一个路由器可以有多个IP地址。 主要作用：将一个大型网络分割成多个子网络，避免产生广播风暴，平衡网络负载，提高网络传输效率。路 由器能监视用户的流量，过滤特定的IP数据报，对保障网络安全也有重要作用。路由器还可以通过优先权控制、 预约网络带宽等措施提供一些网络特殊服务。 2、互联网及其组成互联网的概念 因特网（Internet）指的是在美国ARPA网基础上通过采用TCP/IP协议连接其他计算机网络发展而成的世界上最大的一个互联网络，通常称为“互联网”。 互联网使用TCP/IP协议通过路由器将遍布世界各地的计算机网络互联成为一个超级计算机网络。 互联网的组成 互联网早先的结构分为三级：主干网、地区网和校园网，三级网络覆盖了全美主要的大学和研究所。 目前互联网已经逐渐形成了基于ISP（互联网服务提供商）的多层次结构。 最高级别的第1层ISP的服务面积最大，一般能覆盖国家范围； 第2层ISP和一些大公司都是它们的用户； 第3层ISP又称为本地ISP，它们只拥有本地域范围的网络，普通的校园网和企业网以及家庭和个人都是第3层ISP的用户。 互联网服务提供商ISP通常拥有自己的通信线路，也拥有从互联网管理机构申请得到的许多IP地址。用户的计算机若要接入互联网，必须获得ISP分配的IP地址。 3、互联网的接入我国的互联网的接入情况 大量的局域网和个人计算机用户需要接人互联网。目前我国中心城市普遍采用的做法是，由城域网的运营商（中国电信、中国移动、中国网通等）作为ISP来承担互联网的用户接入任务； 城域网的主干是采用光纤传输的高速宽带网，它一方面与国家主干网连接，提供城市的宽带IP出口，另一方面又汇聚着若干接入网；单位用户和家庭用户可以通过电话线、有线电视电缆、光纤、无线信道等不同技术所组成的接入网接入城域网，再由城域网接入互联网。 ADSL接入的概念 通过固定电话的本地环路（用户线）接人互联网的技术中，最有效的一种是不对称数字用户线（ADSL）它利用普通电话线作为传输介质，只需在线路两端加装ADSL设备（专用的ADSL Modem）即可实现数据的高速传输。 标准ADSL的数据上传速度一般只有64~256kb/s最高达1Mb/s，而数据下行速度在理想状态下可以达到8Mb/s（通常情况下为1Mb/s或2Mb/s左右）。有效传输距离一般在3~5km。 ADSL接入的特点 一条电话线可同时接听、拨打电话并进行数据传输，两者互不影响。 虽然使用的还是原来的电话线，但ADSL传输的数据并不通过电话交换机，所以ADSL上网不需要缴付额外的电话费。 ADSL的数据传输速率是根据线路的情况自动调整的，它以“尽力而为”的方式进行数据传输。 它为下行数据流提供比上行数据流更高的传输速率，适应大多数用户的使用要求。 有线电视网接入 有线电视系统已经广泛采用光纤同轴电缆混合网（HFC）传输电视节目。HFC主干线部分采用光纤连接到小区，然后在“最后1公里”时使用同轴电缆以树型总线方式接入用户居所。 HFC具有很大的传输容量，很强的抗电子干扰能力，它融数字与模拟传输技术于一身，既能传输较高质量和较多频 道的广播电视节目，又能提供高速数据传输和信息增值服务，还可以开展交互式数字视频点播服务。 主机端仍采用传统的以太局域网技术与电缆调制解调器（Cable Modem）连接，后者通过同轴电缆接入HFC。Cable Modem的原理是将同轴电缆的整个频带（大约为5~750MHz）划分为三部分，分别用于数据上传、数据下传及电视节目的下传， 数据通信与电视信号的传输互不影响，上网时仍可收看电视节目。 光纤接入 光纤接入指的是使用光纤作为主要传输介质的互联网接入系统。 在ISP的交换局一侧，应把电信号转换为光信号，以便在光纤中传输，到达用户端之后，要使用光网络单元把光信号转换成电信号，然后经过交换机传送到用户的计算机。 光纤接入网按照主干系统和配线系统的交界点 光网络单元的安装位置可划分为：光纤到路边（FTTC）、光纤到小区（FTTZ）、光纤到大楼（FTTB）、光纤到家庭（FTTH）等几类。 目前采用无线方式接入互联网的主要技术 接入技术 使用的接入设备 数据传输速率 说明 无线局域网接入（WLAN） WiFi无线网卡，无线接入点 11~100Mb/s 必须在安装有接入点（AP）的热点区域中才能接入 GPRS移动电话网接入（2.5G） GPRS无线网卡 56~114kb/s 方便，有手机信号的地方就能上网，但速率不高、费用较高 3G 3G无线网卡 几Mbps 速率不高 4G 4G无线网卡 100~1000Mbps 主流移动通信技术 5G Gbps 发展中 第二章-嵌入式处理器考点1 嵌入式处理器的结构类型考点2 嵌入式处理器简介考点3 ARM处理器概述考点4 典型ARM处理器考点5 ARM Cortex处理器考点6 ARM处理器的工作状态及工作模式考点7 ARM状态下的寄存器组织考点8 ARM处理器的异常考点9 ARM的存储器格式及数据类型考点10 ARM处理器中的MMU和MPU考点11 ARM指令分类及指令格式考点12 ARM指令的寻址方式考点13 ARM指令集考点14 ARM处理器支持的伪指令考点15 ARM汇编器所支持的伪指令考点16 ARM汇编语言的语句格式考点17 汇编语言的程序设计举例第三章-嵌入式系统硬件组成考点1 嵌入式最小硬件系统考点2 基于ARM内核的典型嵌入式应用系统硬件组成考点3 ARM的AMBA总线体系结构及标准考点4 基于ARM内核的嵌入式芯片的硬件组成考点5 常用ARM嵌入式处理芯片考点6 嵌入式系统芯片的选型考点7 存储器层次结构考点8 存储器分类考点9 存储器主要性能指标考点10 片内存储器考点11 片外存储器考点12 外部辅助设备考点13 通用IO接口GPIO考点14 集成电脑互联总线接口I2C考点15 串行外设接口SPI考点16 串行异步通信接口UART3考点17 通用串行总线USB考点18 高清多媒体接口HDMI考点19 常用简单输入设备考点20 常用简单输出设备考点21 S3C2410,S3C2440芯片的内部结构考点22 S3C2410的时钟及电源管理组件考点23 S3C2410 的中断控制器及中断控制考点24 S3C2410的实时时钟RTC考点25 S3C2410的通用IO结构GPIO考点26 S3C2410串行通信接口UART考点27 S3C2410的I2C总线接口考点28 S3C2410的看门狗定时器考点29 基于UART的RS-232,485接口考点30 CAN总线接口考点31 以太网通信接口考点32 常用无线通信接口第四章-嵌入式系统软件考点1 嵌入式系统的软件组成考点2 硬件抽象层与板级支持包考点3 引导加载程序考点4 设备驱动程序的概念考点5 实时系统与实时操作系统考点6 嵌入式操作系统概述考点7 Linux内核考点8 嵌入式Linux操作系统考点9 Android操作系统考点10 IOS操作系统考点11 uC,OS-II操作系统特点考点12 uC,OS-II任务及其管理考点13 uC,OS-II的系统服务考点14 uC,OS-II应用程序设计第五章-嵌入式系统开发考点1 开发嵌入式系统的基础知识考点2 嵌入式系统的开发平台与工具考点3 嵌入式系统的调试考点4 ADS1.2工具软件考点5 RVDS考点6 GNU考点7 Web服务器","categories":[{"name":"技术","slug":"技术","permalink":"http://www.zero-jan.xyz/categories/%E6%8A%80%E6%9C%AF/"}],"tags":[{"name":"学习笔记","slug":"学习笔记","permalink":"http://www.zero-jan.xyz/tags/%E5%AD%A6%E4%B9%A0%E7%AC%94%E8%AE%B0/"}],"author":"ZERO JAN"},{"title":"hello world","slug":"hello-world","date":"2021-01-14T14:12:20.000Z","updated":"2021-02-06T07:33:13.128Z","comments":false,"path":"posts/39c1.html","link":"","permalink":"http://www.zero-jan.xyz/posts/39c1.html","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post $ hexo new \"My New Post\" More info: Writing Run server $ hexo server More info: Server Generate static files $ hexo generate More info: Generating Deploy to remote sites $ hexo deploy More info: Deployment","categories":[{"name":"技术","slug":"技术","permalink":"http://www.zero-jan.xyz/categories/%E6%8A%80%E6%9C%AF/"}],"tags":[{"name":"测试","slug":"测试","permalink":"http://www.zero-jan.xyz/tags/%E6%B5%8B%E8%AF%95/"}],"author":"ZERO JAN"},{"title":"Typora使用教程","slug":"Typora使用教程","date":"2020-08-01T07:06:00.000Z","updated":"2021-02-06T07:33:13.120Z","comments":true,"path":"posts/fc04.html","link":"","permalink":"http://www.zero-jan.xyz/posts/fc04.html","excerpt":"","text":"Typora使用教程Typora快捷键 快捷键 作用 快捷键 作用 Ctrl+1 一级标题 Ctrl+B 字体加粗 Ctrl+2 二级标题 Ctrl+I 字体倾斜 Ctrl+3 三级标题 Ctrl+U 下划线 Ctrl+4 四级标题 Ctrl+Home 返回Typora顶部 Ctrl+5 五级标题 Ctrl+End 返回Typora底部 Ctrl+6 六级标题 Ctrl+T 创建表格 Ctrl+L 选中某句话 Ctrl+K 创建超链接 Ctrl+D 选中某个单词 Ctrl+F 搜索 Ctrl+E 选中相同格式的文字 Ctrl+H 搜索并替换 Alt+Shift+5 删除线 Ctrl+Shift+I 插入图片 Ctrl+Shift+M 公式块 Ctrl+Shift+Q 引用 块元素换行符在Typora中只需回车即可创建新段落 标题级别#：一级标题，快捷键为 Ctrl + 1 ##：二级标题，快捷键为 Ctrl + 2……######：六级标题，快捷键为 Ctrl + 6 引用文字&gt; + 空格 + 引用文字 无序列表使用 + 、- 、* 创建无序列表，任意数字开始+空格创建有序列表 AAA BBB CCC 有序列表使用 数字+英文小数点(.)+空格创建有序列表 AAA BBB CCC Todolist\\ -[ ] 不勾选\\ -[x] 勾选 代码块在Typora中插入程序代码的方式有两种：使用反引号 `（~ 键）、使用缩进（Tab）。 插入行内代码，即插入一个单词或者一句代码的情况，使用 code这样的形式插入 插入多行代码输入3个反引号（`） + 回车，并在后面选择一个语言名称即可实现语法高亮 def helloworld() printf(\"hello,world!\"); 数学表达式 当你需要在编辑器中插入数学公式时，可以使用两个美元符 $$ 包裹 TeX 或 LaTeX 格式的数学公式来实现。根据需要加载 Mathjax 对数学公式进行渲染。 按下 $$，然后按下回车键，即可进行数学公式的编辑。$$ \\mathbf{V}_1\\times\\mathbf{V}_2 = \\mathbf{X}_3$$ 插入表格输入 | 表头1 | 表头2 |并回车。即可创建一个包含2列表。快捷键 Ctrl + T弹出对话框。 id number 不管是哪种方式，第一行为表头，第二行为分割表头和主体部分，第三行开始每一行为一个表格行 列与列之间用管道符号| 隔开 还可设置对齐方式(表头与内容之间)，如果不使用对齐标记，内容默认左对齐，表头居中对齐 左对齐 ：| 右对齐 |： 中对齐 ：|： 为了美观，可以使用空格对齐不同行的单元格，并且在左右两侧都使用|来标记单元格边界 为了使 Markdown 更清晰，| 和 - 两侧需要至少有一个空格（最左侧和最右侧的 | 外就不需要了）。 脚注这个例子的脚注为[1]。 注意：该例子脚注标识是1，脚注标识可以为字母数字下划线，但是暂不支持中文。脚注内容可为任意字符，包括中文 分割线输入 *** 或者 --- 再按回车即可绘制一条水平线，如下： 目录（TOC）输入 [ toc ] 然后回车，即可创建一个“目录”。TOC从文档中提取所有标题，其内容将自动更新。 跨度元素跨度元素即图片，网址，视频等，在Typora中输入后，会立即载入并呈现。 链接内部链接这是一个带有标题属性的 [链接](http://example.com/ \"标题\")这是一个没有标题属性的 [链接](http://example.net/) 链接 链接 参考链接这是一个参考链接。 网址Typora允许用&lt;括号括起来&gt;, 把URL作为链接插入。 输入[td_simon@outlook.com](mailto:td_simon@outlook.com) 即 td_simon@outlook.com。 Typora还会自动链接标准网址。例如：www.simon96.online 图片![显示的文字](图片地址 \"图片标题\")![显示的文字](图片地址) 也可使用快捷键Ctrl+K PS：也可将图片直接拖拽进来，自动生成链接 将图片存在网络服务器上，非常依赖网络。 斜体使用 *单个星号* 或者 _单下划线_ 可以字体倾斜。快捷键 Ctrl + I 斜体 加粗使用 **两个星号** 或者 __两个下划线__ 可以字体加粗。快捷键 Ctrl + B 加粗 加粗斜体使用***加粗斜体***可以加粗斜体。 加粗斜体 代码标记标记代码使用反引号，即在英文输入法下，ESC键下面和1键左边的符号。 使用该 printf()功能 删除线使用~~删除线~~ 快捷键 Alt + Shift + 5 删除线 下划线通过&lt;u&gt;下划线的内容&lt;/u&gt; 或者 快捷键Ctrl + U可实现下划线 下划线的内容 表情符号Github的Markdown语法支持添加emoji表情，输入不同的符号码（两个冒号包围的字符）可以显示出不同的表情。 :smile: 😄 下标可以使用 &lt;sub&gt;文本&lt;/sub&gt;或者~文本~实现下标。 (需在设置中打开该功能) H&lt;sub&gt;2&lt;/sub&gt;O H2O H2O 上标可以使用&lt;sup&gt;文本&lt;/sup&gt;或者^文本^实现上标。 (需在设置中打开该功能) x&lt;sup&gt;2&lt;/sup&gt; x2 x^2^ 高亮==高亮==(需在设置中打开该功能) ==我是最重要的== 文本居中使用 &lt;center&gt;这是要居中的内容&lt;/center&gt;可以使文本居中 这是要居中的文本内容 换行符使用 空格 + 空格 + Enter可以实现换行，例如： 或者可以使用&lt;br/&gt;实现换行。 转义Markdown 使用了很多特殊符号来表示特定的意义，如果需要显示特定的符号则需要使用转义字符，Markdown 使用反斜杠转义特殊字符： 文本加粗 ** 正常显示星号 ** Markdown 支持以下这些符号前面加上反斜杠来帮助插入普通的符号： \\ 反斜线 {} 花括号 _ 下划线 # 井字号 ` 反引号 [] 方括号 . 英文句点 + 加号 * 星号 () 小括号 ! 感叹号 - 减号 HTML支持HTML 不在 Markdown 涵盖范围之内的标签，都可以直接在文档里面用 HTML 撰写。 目前支持的 HTML 元素有：&lt;kbd&gt; &lt;b&gt; &lt;i&gt; &lt;em&gt; &lt;sup&gt; &lt;sub&gt; &lt;br&gt;等 ，如： 使用 &lt;kbd&gt;Ctrl&lt;/kbd&gt;+&lt;kbd&gt;Alt&lt;/kbd&gt;+&lt;kbd&gt;Del&lt;/kbd&gt; 重启电脑 &lt;kbd&gt; &lt;/kbd&gt; – 白色框框 使用 Ctrl+Alt+Del 重启电脑 – 白色框框","categories":[{"name":"资源","slug":"资源","permalink":"http://www.zero-jan.xyz/categories/%E8%B5%84%E6%BA%90/"}],"tags":[{"name":"软件相关","slug":"软件相关","permalink":"http://www.zero-jan.xyz/tags/%E8%BD%AF%E4%BB%B6%E7%9B%B8%E5%85%B3/"}],"author":"ZERO JAN"},{"title":"VsCode的安装、汉化及插件的安装","slug":"VsCode的安装、汉化及插件的安装","date":"2019-11-18T10:59:47.000Z","updated":"2021-02-06T07:33:13.120Z","comments":true,"path":"posts/3069.html","link":"","permalink":"http://www.zero-jan.xyz/posts/3069.html","excerpt":"","text":"VsCode的安装、汉化及插件的安装一、VsCode是什么？Visual Studio Code (简称 VS Code / VSC) 是一款免费开源的现代化轻量级代码编辑器，支持几乎所有主流的开发语言的语法高亮、智能代码补全、自定义快捷键、括号匹配和颜色区分、代码片段、代码对比 Diff、GIT命令 等特性，支持插件扩展，并针对网页开发和云端应用开发做了优化。软件跨平台支持 Win、Mac 以及 Linux，运行流畅，可谓是微软的良心之作。二、VsCode的下载安装1.点击这里下载 2.安装步骤 默认安装路径为C盘，建议改成D、E、F盘，这里我们改成E盘，点击下一步 安装配置，到这一步一定要全选 完成之后就能在桌面找到VsCode的图标，就能打开使用了 三、VsCode插件的安装 刚打开VsCode我们会发现它是全英文，这时候就需要一些强大的插件来汉化它了。 VsCode支持插件扩展，在它的扩展商店我们能找到很多我们需要的插件。 还有许多插件，如下（不全） 1.chinese 汉化VsCode 2.Open HTML in Default Browser ML 右键默认浏览器打开 3.HTML Snippets /dev/stdout 4.HTML CSS Support CSS代码提示补全 5.jQuery Code Snippets jQuery代码提示 6.PHP Intelephense PHP代码提示 7.Live Server 使用服务器的方式打开 8..easy less less编译插件 9.cssrem(rem单位转换器) 设置:文件→首选项→设置里搜索cssrem→rootFontSize一般修改为100重启完成 10.vetur 语法高亮显示 vue2 代码补全提示 四、VsCode快捷键 注释**ctrl+/** 搜索代码**ctrl + f** 切换代码页面**ctrl + tab** 删除选中行 Ctrl+shift+k 另起一行**ctrl+enter** src链接快捷键**script:src** 代码页面快捷移动**fn+ 上下 左右** 删除当前行**Ctrl+shift+K** 快速复制当前行到下/上一行**shift+alt+上下** 代码页面快捷移动**fn+ 上下 左右** 快速选择相同内容**ctrl + d** 替换代码**Ctrl + h**hift+alt+上下`** 代码页面快捷移动**fn+ 上下 左右** 快速选择相同内容**ctrl + d** 替换代码**Ctrl + h**","categories":[{"name":"资源","slug":"资源","permalink":"http://www.zero-jan.xyz/categories/%E8%B5%84%E6%BA%90/"}],"tags":[{"name":"软件相关","slug":"软件相关","permalink":"http://www.zero-jan.xyz/tags/%E8%BD%AF%E4%BB%B6%E7%9B%B8%E5%85%B3/"}],"author":"ZERO JAN"}],"categories":[{"name":"技术","slug":"技术","permalink":"http://www.zero-jan.xyz/categories/%E6%8A%80%E6%9C%AF/"},{"name":"资源","slug":"资源","permalink":"http://www.zero-jan.xyz/categories/%E8%B5%84%E6%BA%90/"}],"tags":[{"name":"学习笔记","slug":"学习笔记","permalink":"http://www.zero-jan.xyz/tags/%E5%AD%A6%E4%B9%A0%E7%AC%94%E8%AE%B0/"},{"name":"测试","slug":"测试","permalink":"http://www.zero-jan.xyz/tags/%E6%B5%8B%E8%AF%95/"},{"name":"软件相关","slug":"软件相关","permalink":"http://www.zero-jan.xyz/tags/%E8%BD%AF%E4%BB%B6%E7%9B%B8%E5%85%B3/"}]}